---
kind: enumMember
id: F:Autodesk.Revit.DB.FailureResolutionType.ShowElements
enum: Autodesk.Revit.DB.FailureResolutionType
source: html/786e6422-f66d-5320-99f9-e530819e50a1.htm
---
# Autodesk.Revit.DB.FailureResolutionType.ShowElements

The standard "Show" may fail in some context, special resolution could be added in this condition to show failing element(s).